<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=06eff79193354cc66f13b65934e5cee745a3dd16]
data.aws_acm_certificate.namabanana: Reading...
data.aws_acm_certificate.namabanana: Read complete after 0s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
data.aws_iam_role.func1_role: Reading...
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
aws_api_gateway_rest_api.send_mail_api: Refreshing state... [id=jqi9ljoedk]
aws_s3_bucket.send_mail_ses_src: Refreshing state... [id=send-mail-ses-src]
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
data.aws_iam_role.func1_role: Read complete after 0s [id=LambdaSESMailRole]
aws_api_gateway_resource.send_mail_api_resource: Refreshing state... [id=egrsqs]
aws_api_gateway_method.send_mail_api_get: Refreshing state... [id=agm-jqi9ljoedk-egrsqs-POST]
aws_s3_object.func1: Refreshing state... [id=send-mail-ses.zip]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
data.aws_iam_policy_document.policy_document: Reading...
data.aws_iam_policy_document.policy_document: Read complete after 0s [id=3292064385]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]
aws_lambda_function.func1: Refreshing state... [id=send-mail-ses]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.send_mail_api_get: Refreshing state... [id=agi-jqi9ljoedk-egrsqs-POST]
aws_api_gateway_deployment.send_mail_api: Refreshing state... [id=0qck05]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.send_mail_api_get must be replaced
-/+ resource "aws_api_gateway_integration" "send_mail_api_get" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "egrsqs" -> (known after apply)
      ~ id                      = "agi-jqi9ljoedk-egrsqs-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ type                    = "AWS_PROXY" -> "AWS" # forces replacement
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Quoted references are deprecated

  on apigateway.tf line 31, in resource "aws_api_gateway_deployment" "send_mail_api":
  31:     "aws_api_gateway_integration.send_mail_api_get",

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.send_mail_api,
  on apigateway.tf line 35, in resource "aws_api_gateway_deployment" "send_mail_api":
  35:   stage_name  = "v1"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
